(function($) {
$.fn.webuploader.defaults.i18n = {
	
	'安装失败！': 'インストールに失敗!',
	'安装已成功，请刷新！': 'インストールは成功しました。！',
	'文件上传组件不支持您的浏览器，请使用高版本浏览器！': 'ファイルアップロードコンポーネントがあなたのブラウザをサポートしません。！',
	
	'点击选择文件': '選択ファイルをクリックする。',
	'点击选择图片': '選択画像をクリックする。',
	'点击选择视频': '選択動画をクリックする。',
	'继续添加': '追加し続ける',
	
	'暂停上传': 'アップロードを一時停止する。',
	'继续上传': 'アップロードを継続する',
	'开始上传': 'アップロードを始める',
	'上传成功': 'アップロードが成功する',
	
	'张图片': ' 枚画像',
	'个文件': ' 一つの書類',
	
	'上传失败': ' アップロードの失敗',
	'重新上传': ' アップロードを再開する ',	
	'或': ' または ',
	'忽略': ' 無視する ',
	
	'总共': '計 ',
	'已上传': 'アップロードした ',
	'失败{0}个': ' {0} つ失敗する',
	
	'您只能上传{0}个文件': 'ファイルは{0}つしかアップロードできません',
	'正在验证文件，请稍等。': '書類を検証中ですので、少々お待ちください。',
	
	'删除': '削除',
	'向右旋转': '右にまがる',
	'向左旋转': '左に回る',
	
	'文件类型不对': '書類のタイプが違う',
	'文件大小超出': '書類のサイズがはみ出る',
	'文件传输中断': 'ファイル転送を中断する。',
	'HTTP请求错误': 'HTTPリクエストエラー',
	'文件格式不允许': 'ファイルフォーマットは許可されない',
	'不要选择重复文件': '重複ファイルは選択しないでください',
	'上传失败，请重试': 'アップロードに失敗したので、試してみてください',
	'服务器返回出错': 'サーバーがエラーに戻る',
	
	'预览生成中': 'プレビュー生成中',
	'不能预览': 'プレビューができない。',
	
	'确定删除该图片吗？': 'この写真を削除することは確定しましたか?',
	'确定删除该文件吗？': 'このファイルを削除することは確定しましたか?',
	
	'等待上传': 'アップロードを待つ',
	'正在上传': 'アップロード中',
	
	'下载': 'ダウンロード',
	'预览': 'プレビュー',
	'查看': 'チェック'
};
})(jQuery);
