(function($) {
$.fn.webuploader.defaults.i18n = {

	'安装失败！': '安裝失敗！',
	'安装已成功，请刷新！': '安裝成功，請重新整理頁面！',
	'文件上传组件不支持您的浏览器，请使用高版本浏览器！': '檔案上傳元件不支援您的瀏覽器，請使用較新版本的瀏覽器！',

	'点击选择文件': '點選選擇檔案',
	'点击选择图片': '點選選擇圖片',
	'点击选择视频': '點選選擇影片',
	'继续添加': '繼續新增',

	'暂停上传': '暫停上傳',
	'继续上传': '繼續上傳',
	'开始上传': '開始上傳',
	'上传成功': '上傳成功',

	'张图片': ' 張圖片',
	'个文件': ' 個檔案',

	'上传失败': ' 上傳失敗',
	'重新上传': ' 重新上傳 ',
	'或': ' 或 ',
	'忽略': ' 忽略 ',

	'总共': '共 ',
	'已上传': '已上傳 ',
	'失败{0}个': ' {0} 個失敗',

	'您只能上传{0}个文件': '您最多只能上傳 {0} 個檔案。',
	'正在验证文件，请稍等。': '正在驗證檔案，請稍候。',

	'删除': '刪除',
	'向右旋转': '向右旋轉',
	'向左旋转': '向左旋轉',

	'不能上传空文件': '無法上傳空白檔案',
	'文件类型不对': '檔案類型不符',
	'文件大小超出': '檔案大小超出限制',
	'文件传输中断': '檔案傳輸中斷',
	'HTTP请求错误': 'HTTP 請求錯誤',
	'文件格式不允许': '不允許的檔案格式',
	'不要选择重复文件': '請勿選擇重複檔案',
	'上传失败，请重试': '上傳失敗，請重試',
	'服务器返回出错': '伺服器回傳錯誤',

	'预览生成中': '預覽產生中',
	'不能预览': '無法預覽',

	'确定删除该图片吗？': '確定要刪除這張圖片嗎？',
	'确定删除该文件吗？': '確定要刪除這個檔案嗎？',

	'等待上传': '等待上傳',
	'正在上传': '上傳中',

	'下载': '下載',
	'预览': '預覽',
	'查看': '檢視'
};
})(jQuery);
